# Домашнее задание по теме: MySQL

## Подготовка

Установка `MySQL Community Server` + `MySQL Workbench`:

- [MySQL Community Server](https://dev.mysql.com/downloads/mysql/)
    
- [MySQL Workbench](https://dev.mysql.com/downloads/workbench/)

In [2]:
# ВНИМАНИЕ: необходимо удостовериться, что виртуальная среда выбрана правильно!

# для Linux
#!which pip

# для Windows
!pip -V

pip 20.3.3 from C:\Anaconda3\envs\one\lib\site-packages\pip (python 3.8)

In [3]:
# установка необходимых пакетов
#!conda install SQLAlchemy pymysql -y

In [4]:
# импорт необходимых пакетов
import pandas as pd    # пакет для работы с таблицами

from sqlalchemy import create_engine

import sqlalchemy
sqlalchemy.__version__

'1.3.23'

In [5]:
# данные для подключения к серверу MySQL
user='root'
password='passworddb'
host='127.0.0.1'
port='3306'

In [6]:
# подключение к серверу MySQL (engine)
engine = create_engine(f"mysql+pymysql://{user}:{password}@{host}:{port}")
engine

Engine(mysql+pymysql://root:***@127.0.0.1:3306)

## ERR Model

<img src="images/eer_model_hw.png"/>

## Создание БД

In [166]:
db_name='store_db'

with engine.connect() as connection:
    connection.execute(f'DROP DATABASE IF EXISTS {db_name}')    # Удалить, если такая БД существует
    connection.execute(f'CREATE DATABASE {db_name}')            # Создать БД
    connection.execute(f'USE {db_name}')                        # Установить БД по-умолчанию

## Создание таблиц

In [167]:
# items

with engine.connect() as connection:
    connection.execute("""CREATE TABLE items (
                        id INT NOT NULL AUTO_INCREMENT,
                        name VARCHAR(20) NOT NULL,  
                        type ENUM('product', 'service') NOT NULL,
                        sale_date DATE NOT NULL,
                        PRIMARY KEY (id))""")

In [168]:
# categories

with engine.connect() as connection:
    connection.execute("""CREATE TABLE categories (
                        id INT NOT NULL AUTO_INCREMENT,
                        name VARCHAR(20) NOT NULL,
                        PRIMARY KEY (id))""")

In [169]:
# prices

with engine.connect() as connection:
    connection.execute("""CREATE TABLE prices (
                        item_id INT NOT NULL,
                        price FLOAT NOT NULL,
                        FOREIGN KEY (item_id) 
                        REFERENCES items(id) 
                        ON DELETE CASCADE 
                        ON UPDATE CASCADE)""")

In [170]:
# items_categories

with engine.connect() as connection:
    connection.execute("""CREATE TABLE items_categories (
                        item_id INT NOT NULL,
                        categories_id INT NOT NULL,
                        FOREIGN KEY (item_id) 
                        REFERENCES items(id)
                        ON DELETE CASCADE 
                        ON UPDATE CASCADE,
                        FOREIGN KEY (categories_id) 
                        REFERENCES categories(id)
                        ON DELETE CASCADE 
                        ON UPDATE CASCADE)""")

## Заполнение таблиц

(Самостоятельно придумать данные для заполнения, это не имеет значения. 5-15 значений в каждой таблице)

In [171]:
# items

with engine.connect() as connection:
    connection.execute("""INSERT INTO items (name, type, sale_date) VALUES 
                        ('table', 'product', '2021-01-20'), 
                        ('chair', 'product', '2021-01-21'),
                        ('cup', 'product', '2021-01-22'),
                        ('spoon', 'product', '2021-02-10'),
                        ('safa', 'product', '2020-12-08'),
                        ('delivery', 'service', '2020-05-15'),
                        ('bottle', 'product', '2021-01-10'),
                        ('assembly', 'service', '2021-01-10'),
                        ('recycling', 'service', '2019-12-31'),
                        ('door', 'product', '2021-01-20')""")

In [172]:
# categories

with engine.connect() as connection:
    connection.execute("""INSERT INTO categories (name) VALUES 
                        ('home'),
                        ('office'),
                        ('garden')""")

In [173]:
# prices

with engine.connect() as connection:
    connection.execute("""INSERT INTO prices (item_id, price) VALUES 
                        (1, 100.00),
                        (2, 10.00),
                        (3, 999.99),
                        (4, 850.00),
                        (5, 990.00),
                        (6, 1000.00),
                        (7, 100.00),
                        (8, 547.00),
                        (10, 7000.50)""")

In [174]:
# items_categories

with engine.connect() as connection:
    connection.execute("""INSERT INTO items_categories (item_id, categories_id) VALUES 
                        (1, 2),
                        (2, 3),
                        (3, 1),
                        (4, 1),
                        (5, 1),
                        (6, 2),
                        (7, 3),
                        (8, 1),
                        (9, 2),
                        (10, 1)""")

## Проверка заполнения таблиц

(Вывести данные, которые были записаны в таблицы)

In [175]:
# items

items_df = pd.read_sql_query("""SELECT * FROM items""", engine)
items_df

   id       name     type   sale_date
0   1      table  product  2021-01-20
1   2      chair  product  2021-01-21
2   3        cup  product  2021-01-22
3   4      spoon  product  2021-02-10
4   5       safa  product  2020-12-08
5   6   delivery  service  2020-05-15
6   7     bottle  product  2021-01-10
7   8   assembly  service  2021-01-10
8   9  recycling  service  2019-12-31
9  10       door  product  2021-01-20

In [176]:
# categories

categories_df = pd.read_sql_query("""SELECT * FROM categories""", engine)
categories_df

   id    name
0   1    home
1   2  office
2   3  garden

In [177]:
# prices

prices_df = pd.read_sql_query("""SELECT * FROM prices""", engine)
prices_df

   item_id    price
0        1   100.00
1        2    10.00
2        3   999.99
3        4   850.00
4        5   990.00
5        6  1000.00
6        7   100.00
7        8   547.00
8       10  7000.50

In [178]:
# items_categories

items_categories_df = pd.read_sql_query("""SELECT * FROM items_categories""", engine)
items_categories_df

   item_id  categories_id
0        1              2
1        2              3
2        3              1
3        4              1
4        5              1
5        6              2
6        7              3
7        8              1
8        9              2
9       10              1

## Обновление данных

In [179]:
# изменить одно наименование (name) товара

with engine.connect() as connection:
    connection.execute("""UPDATE items SET name='sofa' WHERE id=5""")

In [181]:
# проверить, что наименование изменилось

items_df = pd.read_sql_query("""SELECT * FROM items WHERE id=5""", engine)
items_df

   id  name     type   sale_date
0   5  sofa  product  2020-12-08

## Удаление данных

In [182]:
# удалить один товар с условием

with engine.connect() as connection:
    connection.execute("""DELETE FROM items WHERE name='door'""")

In [183]:
# проверить, что наименование товар был удален из таблицы items

items_df = pd.read_sql_query("""SELECT * FROM items""", engine)
items_df

   id       name     type   sale_date
0   1      table  product  2021-01-20
1   2      chair  product  2021-01-21
2   3        cup  product  2021-01-22
3   4      spoon  product  2021-02-10
4   5       sofa  product  2020-12-08
5   6   delivery  service  2020-05-15
6   7     bottle  product  2021-01-10
7   8   assembly  service  2021-01-10
8   9  recycling  service  2019-12-31

In [184]:
# проверить, что наименование товар был удален из таблицы items_categories

items_categories_df = pd.read_sql_query("""SELECT * FROM items_categories""", engine)
items_categories_df

   item_id  categories_id
0        1              2
1        2              3
2        3              1
3        4              1
4        5              1
5        6              2
6        7              3
7        8              1
8        9              2

In [185]:
# проверить, что наименование товар был удален из таблицы prices

prices_df = pd.read_sql_query("""SELECT * FROM prices""", engine)
prices_df

   item_id    price
0        1   100.00
1        2    10.00
2        3   999.99
3        4   850.00
4        5   990.00
5        6  1000.00
6        7   100.00
7        8   547.00

## ERR Model

<img src="images/eer_model_hw.png"/>

## Получение данных (с условиями)

In [186]:
n = 100 # выбрать n
# вывести все данные из таблицы prices, где price больше n

prices_df = pd.read_sql_query("""SELECT * FROM prices WHERE price > """ + str (n), engine)
prices_df

   item_id    price
0        3   999.99
1        4   850.00
2        5   990.00
3        6  1000.00
4        8   547.00

In [187]:
n = 100 # выбрать n
nid = 3 # выбрать nid
# вывести все данные из таблицы prices, где price больше n И item_id не равен nid

prices_df = pd.read_sql_query("""SELECT * FROM prices WHERE price > """ + str (n) + """ AND item_id <> """ + str (nid), engine)
prices_df

   item_id   price
0        4   850.0
1        5   990.0
2        6  1000.0
3        8   547.0

In [188]:
first_syms = 'b' # выбрать символы (буква или несколько букв)
# вывести все данные из таблицы items, где name начинается с first_syms

items_df = pd.read_sql_query("""SELECT * FROM items WHERE name LIKE '""" + str(first_syms) + """%%'""", engine)
items_df

   id    name     type   sale_date
0   7  bottle  product  2021-01-10

In [189]:
last_sym = 'y' # выбрать символ (буква)
item_type = 'service' # выбрать тип

# объединить (union) результаты запросов (повторения допускаются):
# name, type из items, где name заканчивается символом last_sym
# name, type из items, где type равен item_type

union_df = pd.read_sql_query("""SELECT * FROM items WHERE name LIKE '%%""" + str (last_sym) + """'
                                UNION ALL
                                SELECT * FROM items WHERE type='""" + str (item_type) + """'""", engine)
union_df

   id       name     type   sale_date
0   6   delivery  service  2020-05-15
1   8   assembly  service  2021-01-10
2   6   delivery  service  2020-05-15
3   8   assembly  service  2021-01-10
4   9  recycling  service  2019-12-31

In [190]:
# вывести name, type из items и price из prices
# указывать только товары содержащие цены и не должно быть цен без товаров

items_df = pd.read_sql_query("""SELECT 
                                    name,
                                    type,
                                    price
                                FROM items AS items
                                INNER JOIN 
                                prices AS prices ON items.id = prices.item_id""", engine)
items_df

       name     type    price
0     table  product   100.00
1     chair  product    10.00
2       cup  product   999.99
3     spoon  product   850.00
4      sofa  product   990.00
5  delivery  service  1000.00
6    bottle  product   100.00
7  assembly  service   547.00

In [193]:
# вывести name, type из items и price из prices
# могут быть товары, у которых нет цены

items_df = pd.read_sql_query("""SELECT 
                                    name,
                                    type,
                                    price
                                FROM items AS items
                                LEFT JOIN 
                                prices AS prices ON items.id = prices.item_id""", engine)
items_df

        name     type    price
0      table  product   100.00
1      chair  product    10.00
2        cup  product   999.99
3      spoon  product   850.00
4       sofa  product   990.00
5   delivery  service  1000.00
6     bottle  product   100.00
7   assembly  service   547.00
8  recycling  service      NaN

In [195]:
# получить среднюю цену

avg_price_df = pd.read_sql_query("""SELECT AVG(price) FROM prices""", engine)
avg_price_df

   AVG(price)
0  574.623749

In [199]:
# получить id товаров и цену для товаров, у которых цена < средней цены

prices_df = pd.read_sql_query("""SELECT 
                                    item_id,
                                    price
                                FROM prices
                                WHERE 
                                price < (SELECT AVG(price) FROM prices)""", engine)
prices_df

   item_id  price
0        1  100.0
1        2   10.0
2        7  100.0
3        8  547.0